# Целевая функция
V(x)= x[1]+x[2]
dVdx1(x) = 1
dVdx2(x) = 1
dVdx = [dVdx1, dVdx2]

# Ограничения
g1(x) = 1 - x[1]^2 * x[2] / 20
dg1dx1(x) = -x[1] * x[2] / 10
dg1dx2(x) = -x[1]^2 / 20

g2(x) = 1 - (x[1] + x[2]-5)*(x[1]+x[2]-5)/30-(x[1]-x[2]-12)*(x[1]-x[2]-12)/120
dg2dx1(x) = 1 / 15 * (5 - x[1] - x[2]) + 1 / 60 * (12 - x[1] + x[2])
dg2dx2(x) = 1 / 15 * (5 - x[1] - x[2]) + 1 / 60 * (-12 + x[1] - x[2])

g3(x) = 1 - 80 / (x[1]^2 + 8 * x[2] + 5)
dg3dx1(x) = (160 * x[1]) / ((5 + x[1]^2 + 8 * x[2]) * (5 + x[1]^2 + 8 * x[2]))
dg3dx2(x) =  640 / ((5 + x[1]^2 + 8 * x[2]) * (5 + x[1]^2 + 8 * x[2]))

g4(x) = -x[1] + x[2]^2 / 15 + 7 / 15
dg4dx1(x) = -1
dg4dx2(x) = (2 * x[2]) / 15

g5(x) = x[1] - x[2] / 5 - 5
dg5dx1(x) = 1
dg5dx2(x) = -(1 / 5)

g = [g1, g2, g3, g4, g5]
dgdx = [
    [dg1dx1, dg1dx2], 
    [dg2dx1, dg2dx2], 
    [dg3dx1, dg3dx2],
    [dg4dx1, dg4dx2],
    [dg5dx1, dg5dx2]
]

x1_range=[0.0,10.0]
x2_range=[0.0,10.0]
x_range = [x1_range, x2_range]
x0=[5.0,5.0]

conlin(
    V,
    dVdx,
    g,
    dgdx,
    x0,
    x_range    
)